{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 10, 10], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 10], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [100]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["reshape_1", 0, 0]]}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "gru_1", "class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0], ["gru_1", 0, 1]]}, "keras_version": "2.2.4", "backend": "tensorflow"}